# **Week 03**

# 09 : Membagi Data Frame Menjadi Dua Secara Acak

## Import Modules

In [1]:
import pandas as pd
import numpy as np

# Cek Versi
print(pd.__version__)
print(np.__version__)

2.1.3
1.26.2

## Persiapan Data Frame

In [2]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  13  19   4  17  18
1  12   2   7   3  14
2  12   1   3   2   5
3   7   2   5  15  16
4   1   5  19  19   3
5   2   6  12   1  13
6   6  17  14   2  17
7  18  18   4   1   4
8  13  16  19  14  10
9   7  11  15  19   3

## Membagi Data Frame Menjadi Dua Secara Acak Berdasarkan Proporsi Tertentu

In [3]:
df.shape

(10, 5)

In [4]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [5]:
df_1

    A   B   C   D   E
0  13  19   4  17  18
8  13  16  19  14  10
6   6  17  14   2  17
5   2   6  12   1  13
4   1   5  19  19   3
1  12   2   7   3  14
9   7  11  15  19   3

In [6]:
df_2

    A   B  C   D   E
2  12   1  3   2   5
3   7   2  5  15  16
7  18  18  4   1   4

# 10 : Mengganti Nama Kolom pada Data Frame Berdasarkan Pola

## Import Modules

In [7]:
import pandas as pd

print(pd.__version__)

2.1.3

## Persiapan Data Frame

In [8]:
df = pd.read_csv('./data/titanicfull.csv')
df.columns = ['Pclass', 'Survival status', 'full Name', 'Sex  ', '  Age', 
              'Sib SP', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
df_backup = df.copy(deep=True)

df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S


## Menggunakan Lowercase untuk Nama Kolom dan Mengganti Spasi dengan _

In [9]:
df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head()

,pclass,survival_status,full_name,sex__,__age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## Memangkas Kelebihan Spasi pada Nama Kolom

In [10]:
df = df_backup.copy(deep=True)

df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# 11 : Seleksi Kolom dan Baris pada Data Frame Menggunakan loc

## Import Modules

In [11]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.3
1.26.2

## Persiapan Data Frame

In [12]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   6   1   4   5  11
1  10   7   1  19  11
2   3  14   3  15   8
3   5  11  19   8  19
4   6  10  14   9   9
5  19   6  11  18  16
6  12  14   6  11  16
7   7   1   4   2  17
8   9   7   4   4  14
9   3  18   5  10   3

## Seleksi kolom dan baris menggunakan loc

In [13]:
df.loc[[0,3,4], ['B','E']]

    B   E
0   1  11
3  11  19
4  10   9

## Seleksi baris dengan kondisi

In [14]:
df.loc[df['B']>10, ['B','D','E']]

    B   D   E
2  14  15   8
3  11   8  19
6  14  11  16
9  18  10   3

## Slicing Data Frame dengan loc

In [15]:
df.loc[0:4, 'B':'D']

    B   C   D
0   1   4   5
1   7   1  19
2  14   3  15
3  11  19   8
4  10  14   9

# 12 : Membentuk Kolom Bertipe datetime dari Beberapa Kolom Lain pada Pandas Data Frame

## Import Modules

In [16]:
import pandas as pd

print(pd.__version__)

2.1.3

## Persiapan Data Frame

In [17]:
data = {'day':[1, 2, 10 ,25, 12], 
        'month':[1, 2, 4, 5, 6], 
        'year':[2000, 2001, 2010, 2015, 2020]}

df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

## Membentuk Kolom Bertipe datetime

In [18]:
df['penanggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
df

   day  month  year penanggalan
0    1      1  2000  2000-01-01
1    2      2  2001  2001-02-02
2   10      4  2010  2010-04-10
3   25      5  2015  2015-05-25
4   12      6  2020  2020-06-12

In [19]:
df.dtypes # tipe data penanggalan sudah menjadi datetime.

day                     int64
month                   int64
year                    int64
penanggalan    datetime64[ns]
dtype: object